#### Berkenalan Dengan Series

In [1]:
# import library
import numpy as np
import pandas as pd

In [2]:
labels = ['a', 'b', 'c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10, 'b':20, 'c':30} # tag dan value

In [3]:
pd.Series(my_list, name = 'mylist')

0    10
1    20
2    30
Name: mylist, dtype: int64

In [4]:
pd.Series(my_list, labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [6]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [7]:
ser1 = pd.Series([1,2,3,4], index = ['USA', 'Germany', 'USSR', 'Japan'])
ser2 = pd.Series([1,2,5,4], index = ['USA', 'Germany', 'Italia', 'Japan'])
print(ser1)
print(ser2)

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64
USA        1
Germany    2
Italia     5
Japan      4
dtype: int64

In [8]:
# menampilkan index dari series
print(f'ini adalah index dari series : {ser1.index}')

# menampilkan values dari series
print(f'ini adalah values dari series : {ser2.values}')

ini adalah index dari series : Index(['USA', 'Germany', 'USSR', 'Japan'], dtype='object')
ini adalah values dari series : [1 2 5 4]

##### Berkenalan dengan Data Frame

In [9]:
from numpy.random import seed, randn
seed(101)

In [10]:
#dataframe adalah sekumpulan series yang ditempel menjadi 1 dan berbagi index. 
df =pd.DataFrame(randn(5, 4), index =list('ABCDE'), columns = list('WXYZ'))
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [11]:
# selecting column using square braclet
print('memilih kolom W dan index A\n',df['W']['A'] )
print('memilih kolom W dan X serta index A hingga D\n',df[['W','X']]['A':'D'])

memilih kolom W dan index A
 2.706849839399938
memilih kolom W dan X serta index A hingga D
           W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872

In [12]:
# Using column attribute and row label
print('memilih kolom W dan index D\n',df.W['D'])
print('memilih kolom Z dan index A hingga C\n',df.Z['A':'C'])

memilih kolom W dan index D
 0.18869530944922425
memilih kolom Z dan index A hingga C
 A    0.503826
B    0.605965
C   -0.589001
Name: Z, dtype: float64

In [13]:
# selectong column using loc 
print('memilih kolom W dan seluruh baris atau  index\n',df.loc[:, 'W'])
print('memilih kolom W dan Z serta seluruh baris  atau  index\n',df.loc[:, ['W','Z']])
print('memilih kolom W dan index B\n',df.loc['B', 'W'])
print('memilih kolom W serta index A dan C\n',df.loc[['A','C'], 'W'])

memilih kolom W dan seluruh baris atau  index
 A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64
memilih kolom W dan Z serta seluruh baris  atau  index
           W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509
memilih kolom W dan index B
 0.6511179479432686
memilih kolom W serta index A dan C
 A    2.706850
C   -2.018168
Name: W, dtype: float64

In [14]:
# selectong column using iloc
print('memilih kolom ke-0 dan seluruh baris atau  index\n',df.iloc[:, 0])
print('memilih kolom ke-1  ke-2 dan Z serta seluruh baris  atau  index\n',df.iloc[:, [1,2]])
print('memilih kolom ke-3 dan index ke-3\n',df.iloc[3, 3])
print('memilih kolom ke-2 serta index ke-0, ke-4 \n',df.iloc[[0, 4], 2])

memilih kolom ke-0 dan seluruh baris atau  index
 A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64
memilih kolom ke-1  ke-2 dan Z serta seluruh baris  atau  index
           X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
C  0.740122  0.528813
D -0.758872 -0.933237
E  1.978757  2.605967
memilih kolom ke-3 dan index ke-3
 0.9550565092637361
memilih kolom ke-2 serta index ke-0, ke-4
 A    0.907969
E    2.605967
Name: Y, dtype: float64

In [15]:
# jika memilih seluruh baris dan kolom tertentu yangg > 2, maka  gunakan double square bracket
df[['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [16]:
print(type(df['W']))
print(type(df[['W','X']]))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [17]:
#### Membuat kolom baru 
df['NEW'] = ['Text',1,2,3,4]
df

          W         X         Y         Z   NEW
A  2.706850  0.628133  0.907969  0.503826  Text
B  0.651118 -0.319318 -0.848077  0.605965     1
C -2.018168  0.740122  0.528813 -0.589001     2
D  0.188695 -0.758872 -0.933237  0.955057     3
E  0.190794  1.978757  2.605967  0.683509     4

In [18]:
# Ngedrop kolom tertentu
df.drop('W', axis = 1)
df

          W         X         Y         Z   NEW
A  2.706850  0.628133  0.907969  0.503826  Text
B  0.651118 -0.319318 -0.848077  0.605965     1
C -2.018168  0.740122  0.528813 -0.589001     2
D  0.188695 -0.758872 -0.933237  0.955057     3
E  0.190794  1.978757  2.605967  0.683509     4

In [19]:
# Ngedrop kolom tertentu secara permanen 
df.drop('W', axis = 1, inplace = True)

In [20]:
df

          X         Y         Z   NEW
A  0.628133  0.907969  0.503826  Text
B -0.319318 -0.848077  0.605965     1
C  0.740122  0.528813 -0.589001     2
D -0.758872 -0.933237  0.955057     3
E  1.978757  2.605967  0.683509     4

In [21]:
# Conditional Selection
print('Hasilnya berupa Boolean\n',df['Z'] > 0)
print('Hasilnya berupa Data yang sebenarnya \n', df[df['Z'] > 0])

Hasilnya berupa Boolean
 A     True
B     True
C    False
D     True
E     True
Name: Z, dtype: bool
Hasilnya berupa Data yang sebenarnya
           X         Y         Z   NEW
A  0.628133  0.907969  0.503826  Text
B -0.319318 -0.848077  0.605965     1
D -0.758872 -0.933237  0.955057     3
E  1.978757  2.605967  0.683509     4

In [22]:
# Condtional Selection > 1 kondisi
df[(df['X'] > 0) & (df['Z'] > 1)]

Empty DataFrame
Columns: [X, Y, Z, NEW]
Index: []

In [23]:
# menampilkan kolom tertentu berdasarkan kondisi pada kolom lain
df[df['Z'] > 0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [24]:
# Jika nilai X > 0, maka Z ditambah dengan 5
df.Z[df.X > 0] += 5
print(df)

          X         Y         Z   NEW
A  0.628133  0.907969  5.503826  Text
B -0.319318 -0.848077  0.605965     1
C  0.740122  0.528813  4.410999     2
D -0.758872 -0.933237  0.955057     3
E  1.978757  2.605967  5.683509     4

C:\Users\user only\Anaconda3\envs\tensorflow_cpu\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

#### Missing Value

In [25]:
df1 = pd.DataFrame({'A': [1,2,np.nan, 3],
                  'B': [5, np.nan, np.nan, 0],
                  'C':[1,2,3, 2]})
df1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3
3  3.0  0.0  2

In [26]:
# Menampilkn data yang ada nilai NaN nya (Missing Value)
df1.loc[:, df1.isnull().any()]

     A    B
0  1.0  5.0
1  2.0  NaN
2  NaN  NaN
3  3.0  0.0

In [27]:
# Menampilkn data yang ada nilai NaN nya (Missing Value)
df1.loc[:, df1.notnull().all()]

   C
0  1
1  2
2  3
3  2

#### Handling Missing Value

In [28]:
# Menghapus rows yang ada nilai NaNnya berdasarkan baris
df1.dropna(how = 'any')
# sales.dropna()

     A    B  C
0  1.0  5.0  1
3  3.0  0.0  2

In [29]:
# Menghapus rows yang ada nilai NaNnya berdasarkan baris
df1.dropna(how = 'any', axis = 1)
# sales.dropna()

   C
0  1
1  2
2  3
3  2

In [30]:
# menghapus missing value berdasarkan threshold
df1.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
3  3.0  0.0  2

In [31]:
# Mengisi nilai Missing Value dengan suatu nilai tertentu
df1.fillna(value = 'FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3
3           3           0  2

In [32]:
# Mengisi nilai Missing Value dengan mean
df1['A'].fillna(value = df1['A'].mean())

0    1.0
1    2.0
2    2.0
3    3.0
Name: A, dtype: float64

In [33]:
# mengetahui berapa banyak Missing Value setiap kolomnya dan urutkan 
df1.isna().sum().sort_values(ascending = False)

B    2
A    1
C    0
dtype: int64

#### Data Agregating

In [34]:
sales = pd.DataFrame(
    {
        'weekday': ['Sun', 'Sun', 'Mon', 'Mon'],
        'city': ['Austin', 'Dallas', 'Austin', 'Dallas'],
        'bread': [139, 237, 326, 456],
        'butter': [20, 45, 70, 98]
    }
)
sales

  weekday    city  bread  butter
0     Sun  Austin    139      20
1     Sun  Dallas    237      45
2     Mon  Austin    326      70
3     Mon  Dallas    456      98

In [35]:
# Jumlah setiap Unique Value
sales['weekday'].value_counts()

Mon    2
Sun    2
Name: weekday, dtype: int64

In [36]:
# Banyaknya unique value
sales['weekday'].nunique()

2

In [37]:
sales.groupby('weekday').count()

         city  bread  butter
weekday
Mon         2      2       2
Sun         2      2       2

In [38]:
sales.groupby(['weekday','city']).sum()

                bread  butter
weekday city
Mon     Austin    326      70
        Dallas    456      98
Sun     Austin    139      20
        Dallas    237      45

In [39]:
sales.groupby(['weekday','city']).sum()['butter']
# sales.groupby(['weekday','city'])['butter'].sum()

weekday  city
Mon      Austin    70
         Dallas    98
Sun      Austin    20
         Dallas    45
Name: butter, dtype: int64

In [40]:
sales.groupby(['weekday'])['bread','butter'].mean()

         bread  butter
weekday
Mon      391.0    84.0
Sun      188.0    32.5

In [41]:
sales.groupby('city')[['butter','bread']].agg('max')

        butter  bread
city
Austin      70    326
Dallas      98    456

In [42]:
sales.groupby('weekday')['butter'].agg(['max','sum','mean'])

         max  sum  mean
weekday
Mon       98  168  84.0
Sun       45   65  32.5

#### Data Merging

In [43]:
movie_cols = ['movie_id', 'title']
movies = pd.read_table('u.item', sep='|', header=None, names=movie_cols, usecols=[0, 1])
print(movies.head())
print(movies.shape)

   movie_id              title
0         1   Toy Story (1995)
1         2   GoldenEye (1995)
2         3  Four Rooms (1995)
3         4  Get Shorty (1995)
4         5     Copycat (1995)
(1682, 2)

In [44]:
print('Jumlah unique movied id', movies.movie_id.nunique())

Jumlah unique movied id 1682

In [45]:
rating_cols = ['user_id', 'movie_id', 'rating', 'timestamp']
ratings = pd.read_table('u.data', sep='\t', header=None, names=rating_cols)
print(ratings.head())
print(ratings.shape)

   user_id  movie_id  rating  timestamp
0      196       242       3  881250949
1      186       302       3  891717742
2       22       377       1  878887116
3      244        51       2  880606923
4      166       346       1  886397596
(100000, 4)

Anggaplah Anda ingin memeriksa Dataframe **rating**, tetapi Anda ingin mengetahui judul setiap film berdasarkan movie_id-nya. Cara terbaik untuk mencapai tujuan ini adalah dengan "menggabungkan" kedua DataFrames menggunakan fungsi ```merge```pada Pandas:

In [46]:
movies_ratings = pd.merge(movies, ratings)
print(movies_ratings.head())
print(movies_ratings.shape)

   movie_id             title  user_id  rating  timestamp
0         1  Toy Story (1995)      308       4  887736532
1         1  Toy Story (1995)      287       5  875334088
2         1  Toy Story (1995)      148       4  877019411
3         1  Toy Story (1995)      280       4  891700426
4         1  Toy Story (1995)       66       3  883601324
(100000, 5)

In [47]:
# What if the columns you want to join on don't have the same name?
movies.columns = ['m_id', 'title']
movies.columns

Index(['m_id', 'title'], dtype='object')

In [48]:
pd.merge(movies, ratings, left_on='m_id', right_on='movie_id').head()

   m_id             title  user_id  movie_id  rating  timestamp
0     1  Toy Story (1995)      308         1       4  887736532
1     1  Toy Story (1995)      287         1       5  875334088
2     1  Toy Story (1995)      148         1       4  877019411
3     1  Toy Story (1995)      280         1       4  891700426
4     1  Toy Story (1995)       66         1       3  883601324

In [49]:
# What if you want to join on one index?
movies = movies.set_index('m_id')
movies.head()

                  title
m_id
1      Toy Story (1995)
2      GoldenEye (1995)
3     Four Rooms (1995)
4     Get Shorty (1995)
5        Copycat (1995)

In [50]:
pd.merge(movies, ratings, left_index=True, right_on='movie_id').head()

                 title  user_id  movie_id  rating  timestamp
24    Toy Story (1995)      308         1       4  887736532
454   Toy Story (1995)      287         1       5  875334088
957   Toy Story (1995)      148         1       4  877019411
971   Toy Story (1995)      280         1       4  891700426
1324  Toy Story (1995)       66         1       3  883601324

In [51]:
# What if you want to join on two indexes?
ratings = ratings.set_index('movie_id')
pd.merge(movies, ratings, left_index=True, right_index=True).head()

              title  user_id  rating  timestamp
1  Toy Story (1995)      308       4  887736532
1  Toy Story (1995)      287       5  875334088
1  Toy Story (1995)      148       4  877019411
1  Toy Story (1995)      280       4  891700426
1  Toy Story (1995)       66       3  883601324

#### Joining
![Joining Data Frame](1_9eH1_7VbTZPZd9jBiGIyNA.png)

In [52]:
A = pd.DataFrame({'color': ['green', 'yellow', 'red'], 'num':[1, 2, 3]})
A

    color  num
0   green    1
1  yellow    2
2     red    3

In [53]:
B = pd.DataFrame({'color': ['green', 'yellow', 'pink'], 'size':['S', 'M', 'L']})
B

    color size
0   green    S
1  yellow    M
2    pink    L

##### Inner join

Only include observations found in both A and B:

In [54]:
pd.merge(A, B, how='inner')

    color  num size
0   green    1    S
1  yellow    2    M

##### Outer join
Include observations found in either A or B:

In [55]:
pd.merge(A, B, how='outer')

    color  num size
0   green  1.0    S
1  yellow  2.0    M
2     red  3.0  NaN
3    pink  NaN    L

##### Left join
Include all observations found in A:

In [56]:
pd.merge(A, B, how='left')

    color  num size
0   green    1    S
1  yellow    2    M
2     red    3  NaN

##### Right join

Include all observations found in B:

In [57]:
pd.merge(A, B, how='right')

    color  num size
0   green  1.0    S
1  yellow  2.0    M
2    pink  NaN    L